[
  {
    "id": "G-3-1",
    "block": "General",
    "clause": "6.7.1.1",
    "requirement": "The areas having storage, manufacturing, hazardous activities such as paint store, oil storage, spray booths, etc, shall be separated from non-hazardous areas like administrative office, staff canteen, etc by fire rated walls/doors of 120 min fire resistance rating."
  },
  {
    "id": "G-3-2",
    "block": "General",
    "clause": "6.7.1.1",
    "requirement": "The fire resistance rating of high hazardous areas like petrochemical, explosives shall be 240 min."
  },
  {
    "id": "G-3-3",
    "block": "General",
    "clause": "6.7.1.1 a & b",
    "requirement": "The separating wall shall be carried through the roof. The screen wall shall be of not less than 230 mm in thickness if it is an extension of a masonry wall, and not less than 150 mm in thickness if it is an extension of a reinforced concrete wall."
  },
  {
    "id": "G-3-4",
    "block": "General",
    "clause": "6.7.1.1 g",
    "requirement": "Doors and window openings in external walls within 3 m of the fire separating walls shall be protected by fire doors having a rating of at least 60 min and window openings may be protected by fire resistant glass assembly having same fire rating."
  },
  {
    "id": "G-3-5",
    "block": "General",
    "clause": "6.7.1.1 k",
    "requirement": "Storage areas shall be separated from the remainder of the building/block by fire walls."
  },
  {
    "id": "G-3-6",
    "block": "General",
    "clause": "6.7.1.1 m",
    "requirement": "Moderate and high hazard areas in industries to have two fire doors each having 180 min fire resistance rating."
  },
  {
    "id": "G-3-7",
    "block": "General",
    "clause": "6.7.2.2 a",
    "requirement": "Exits need be provided only for the persons actually  employed;  spaces  not  subject  to human occupancy because of the presence of machinery or equipment may be excluded from consideration."
  },
  {
    "id": "G-3-8",
    "block": "General",
    "clause": "6.7.2.2 b",
    "requirement": "Where  unprotected  vertical  openings  are necessary to manufacturing operations, these may be permitted beyond the limits specified for industrial occupancy, provided every floor level has direct access to one or more enclosed stairways or other exits protected against obstruction by any fire in the open areas connected  by  the  unprotected  vertical openings or smoke therefrom"
  },
  {
    "id": "G-3-9",
    "block": "General",
    "clause": "6.7.2.3 a",
    "requirement": "From every point in every floor area, there shall  be  at  least  two  exits  accessible  in different directions; where floor areas are divided into rooms, there shall be at least two ways of escape from every room, however small rooms, except toilet rooms, so located that the points of access thereto are out of or suitably shielded from areas of high hazard."
  },
  {
    "id": "G-3-10",
    "block": "General",
    "clause": "6.7.2.3 b",
    "requirement": "In addition to types of exits for upper floors specified for Group G occupancies, slide escapes may be used as required exits for both new and existing buildings."
  },
  {
    "id": "G-3-11",
    "block": "General",
    "clause": "6.7.3 a",
    "requirement": "In any room in which volatile flammable substances  are  used  or  stored,  no  device generating a glow or flame capable of igniting flammable vapour shall be installed or used, such a room shall be provided with a suitably designed  exhaust  ventilation  system as per Annex M."
  },
  {
    "id": "G-3-12",
    "block": "General",
    "clause": "6.7.3 c",
    "requirement": "Fire protection considerations for venting industrial occupancies shall be as in Annex M."
  }
]